{
  "hero_arc": {
    "choice": "4",
    "name": "Tragedy Arc",
    "description": "The protagonist fails both externally and internally. They don't achieve their goal and don't grow or change for the better.",
    "want_need_relationship": "Gets neither WANT nor NEED",
    "examples": "Hamlet, Romeo and Juliet, The Great Gatsby (Jay Gatsby)"
  },
  "source_story": {
    "title": "Star Wars: Episode IV – A New Hope",
    "type": "movie",
    "author": "George Lucas",
    "core_theme": "The hero's journey and the triumph of hope over tyranny",
    "core_structure_summary": "A tightly structured three‑act screenplay: Act I (setup) establishes Tatooine, the droids’ arrival, and Luke’s call to adventure; Act II (confrontation) compresses the Mos Eisley mission, the Death Star’s menace, and the reveal of the weakness; Act III (resolution) delivers the Battle of Yavin and its payoff, culminating in the Death Star’s destruction and the Rebel celebration.",
    "plot_summary": "Farm boy Luke Skywalker is thrust into a galactic conflict when he aids droids bearing secret plans for the Empire’s planet‑killing Death Star. Guided by the Jedi Obi‑Wan Kenobi, he joins the Rebel Alliance to rescue Princess Leia and deliver the schematics needed to destroy the superweapon.",
    "key_beats": [
      "Opening situation: Princess Leia stashes the Death Star plans in R2‑D2, who escapes to Tatooine with C‑3PO; Luke discovers the holographic plea for Obi‑Wan Kenobi’s help.",
      "Inciting incident: Luke meets Obi‑Wan, learns of his connection to the Jedi and his father, and agrees to escort the droids to the Rebels, setting the galactic adventure in motion.",
      "Midpoint turning point: The Millennium Falcon is captured by the Death Star; the Rebels discover a tiny exhaust port vulnerable to proton torpedoes; Han Solo is paid but refuses to stay for the battle.",
      "Climax: The Rebel fleet attacks the Death Star; in the climactic trench run, Han returns to aid Luke, who uses the Force to fire the torpedoes that destroy the station.",
      "Resolution: The Death Star explodes; the Rebels celebrate and honor Luke and Han; Leia presents the medals that signify the first major victory against the Empire."
    ]
  },
  "setting": {
    "genre": "medieval",
    "description": "A living medieval world takes shape where stone bones meet winter breath, where ritual smoke whispers to river mists, and where the market’s gossip threads through the lanes like a loom weaving a cloth of fortunes.\n\n# The Mirror Rivers: A Medieval World Sketch\n\n## 1. Visual Atmosphere and Aesthetic\n- **Low sky, high banks**: Broad river valleys ringed by basalt terraces and slate roofs, with mist rising like shy ghosts at dawn; everywhere, lamps in holly-dark halls cut golden scars through the dusk.\n- **Color dialect**: Ash-grey slate and smoky brick dominate the cities; forest green and frost white belong to the villages; copper and ochre turn up in the markets, while scarlet ribbons at funerals and ivory wedding veils make public rites vivid and ceremonial.\n- **Iconography**: Weather vanes in the shape of herons and wolves; hilts etched with mirrored-glass fish; carving motifs of reeds and riverlooms; stained glass filtering the world into blue-green and deep amber, as if the sky has been shattered into glinting shards.\n- **Seasonal palette**: Spring sees cherry blossoms flutter like gossip in the wind; summer is all copper kettles and rag-banners drying on lines; autumn burns bright with poplar leaves and bundles of ropey flax; winter turns the world into a frost-white catafalque under heavy clouds and trudging travelers.\n- **Luminous details**: Ice whispering under heavy boots; torchlight on a ferryman’s face like molten honey; the Mirror River catching storm light, a mirror of liquid thoughts.\n\n## 2. Technology/Magic Level\n- **Material tech**: Grain mills and windmills, riverine waterwheels, pole lathes and charcoal forges, but **no gunpowder or steam power**; **inlaid bronze** drives gears in clocks and waterworks; planked coracles on tributaries; heavy wagons with iron rims; simple block-and-tackle; ceramic glue; salt-curing for preservation.\n- **Medicine**: Herbalists boil willow bark for fevers, stitch wounds with linen and dung ointment, brew lavender teas for nerves; midwives know constellations to time births; barber-surgeons pull teeth but do not cut limbs; eye salves of charcoal and fat blur corruption’s edge.\n- **Magic**: Practiced like a craft; saltbinders weave “knit of salt” to weight nets and hold doors fast; riverweavers read currents and fish passes; bellwrights make bronze reliquaries speak; lorewomen scribe charms into wax tablets; lesser wonderworkers stitch dreams into pillow seams or bind fear in knots; **“deep-source” talents** remain rare, as unpredictable as a lightning rod in the plain.\n- **Information**: Scribes in citadel scriptoria and town clerks fill ledgers; **bell cadences** convey news across valley clusters; no printing press, but presses for ointments and wax caps for parchment; boards at guildhalls post bids and bounties.\n\n## 3. Social Structures\n- **Stratified yet entangled**: Baronies, bishoprics, guilds, and wards braid authority; **nobles rule land**, **guilds own skills**, **abbeys hold learning**, and **communes negotiate charters**—each strand tugs the others like a tug-of-war in a river.\n- **Family and household**: Cousins interwoven in clan oaths; daughters inherit when sons are absent; fosterlings move between households to knit alliances; patron households sponsor artisans; widow-wardens manage fields and guest halls.\n- **Wards and assemblies**: City wards elect wardens; town squares host ring-moot mornings for disputes; riverside guildhalls convene candle counts to tally profits and wage schedules.\n- **Order of precedence**: Knights, clergy, guild masters, municipal guilders, journeymen, laborers, sailors, thralls; yet the **river respects no crest**, and the market acknowledges gold above blood.\n\n## 4. Common Architectural Styles\n- **Riverborne**: Riverside houses on pilings with low arches and hanging garden nets; planked quays and ferry steps; granaries built on stilts with ventilated slats.\n- **Hillfort**: Cyclopean stone bases with battlements; watchtowers on the high ground; cathedrals of ashlar limestone with flying buttresses; belltowers crowned by ironwork weathervanes.\n- **Market Quarter**: Open-fronted brick bays, hipped roofs of slate and thatch, cobbled alleys smelling of grain dust and leather, awnings striped like river carp scales.\n- **Abbey and Libraries**: Perched libraries with cedar rafters and silver-bound ledgers, peristyle cloisters with water channels, the High Candle Room where candles burn forever; crypt walls lined with chapels to patron saints and river spirits.\n- **Defenses**: Stone Keeps with chamfered corners and portcullises, gatehouses like narrowed throats; sally ports shaped like fish gills; ramparts bristling with falconry perches.\n\n## 5. Transportation Methods\n- **Rivers**: **Barges** heaped with salt, tar, and wool; **coracles** as nimble as riverfish; ferrymen calling out fares; **candle boats** for winter, bobbing and swaying like warm thoughts on cold water.\n- **Roads**: Packs on mule trains; ox-drawn wagons clattering across plank bridges; palisade towns with post stations where relays change horses; pilgrimage paths worn smooth by prayer.\n- **Airways**: Falconry networks deliver messages; kites bear bundles; lifts powered by counterweights bring grain up cliff towns; **anemocarriages** ride on long slopes when winds align.\n- **Border crossings**: Moated gatehouses with timber booms; watchmen test toll coins with the bite of iron; herbalists bribe guards with dreamloaves and lavender cakes.\n\n## 6. Daily Life Details\n- **Ritual hours**: Dawn bell to start markets; midday bell for noontide soup; compline bell to shut doors; children count bells instead of hours.\n- **Work**: Dyers hanging variegated cloth from rods; tanners curing hides in vats; coopers sawing staves and shouting in rhythm; brewers stirring wort; women spinning flax at hearths; barbers lancing boils; quay clerks tallying sacks.\n- **Food**: Salt herring, oat porridge with brown sugar, barley stew, honey cakes for feasts; new bread smelling like sunrise; rye sours and barley ales from jugs; smoked goose for winter.\n- **Seasons**: Autumn crowds the granaries; winter’s fasts carve thin faces; spring floods turn streets to rivers, people walking like clumsy cranes; summer’s heat wakes night festivals and women’s song.\n- **Care**: The old sit by the hearth and shuffle cards; children invent songs about wolves and wolves’ mothers; midwives chant constellations when births are slow.\n\n## 7. Cultural Norms\n- **Names and introductions**: People use place-of-origin before given names, often with a craft tag; strangers bowed to thrice in the market and once at the gatehouse.\n- **Hospitality**: Bread, salt, and a seat are owed to travelers; bowls returned clean and swept; a home where one door is always open is called a “harbor house.”\n- **Oaths**: Cords tied around wrists to bind promises; water stood in a bowl to seal oaths on rivers; fines for breaking guest rites and guild bids.\n- **Clothing**: Wool and linen in muted tones; colors for status—purple for high clergy, emerald for doctors, sable for merchant guilders; jackets patched like a mural.\n- **Marriage and death**: Betrothals at the peristole’s edge while bells ring; funerals in blue shrouds under pine boughs; obituary crows on rooftops carrying messages in beaks.\n\n## 8. Typical Conflicts or Tensions\n- **Water rights**: Grist rights vs. river rights; mills in the hands of barons clash with fishers; flood diversions condemned by abbot communities.\n- **Guild sovereignty**: Anvils vs. parchment; artificers wanting toll breaks on roads and bridges; municipal clerks against guild monopolies.\n- **Border hotheads**: Mountain towns claiming river ferry levies; feuds over timber forests; disputes over salt caravans passing through abbey lands.\n- **Religious divides**: Abbey oaths against bellwright miracles; **sorcerers and “soulkeepers”** arguing whether charms trap or release spirits.\n- **Minority tensions**: Folk marked by ritual scars, the “fire-touched,” or “weave-born” treated with suspicion yet needed for their gifts; rumors fester like damp in a cellar.\n- **Elm Blight**: A blight that devours libraries and the open wills on chests; communities split between those who cleanse and those who shrug it off; blood deals and abbey spores are as much a currency as coin.\n\n## 9. Sensory Details\n- **What it looks like**: **Stormlight sliding over basalt** like liquid mercury; slate roofs like a field of sleepy beetles; lanterns bobbing like earthbound stars in the lanes.\n- **What it sounds like**: Bell cadences like **footfalls in a cathedral**; hammer-songs echoing; river ice sighing; crows clacking at dawn as gossip birds.\n- **What it smells like**: Wet lime, fresh bread, peat smoke, tar on quays; tanner’s acrid brew; copper pennies turned in the palm; clover and lavender drying on door lintels.\n- **What it feels like**: A cold that bites like a wolf’s maw; rope burn on hands; velvety felt against cheeks; brass doors cutting winter’s kiss; linen steeped in river water.\n\n## 10. Unique World-Building Elements\n- **The Mirror Rivers**: Twin rivers—Frostleg and Silverset—carry glassy surfaces at dawn, and **reflections can be coaxed into revelation** by riverweavers, a practice banned in some baronies and sanctified by others.\n- **Bellwright Guild**: Masteries of bronze and wind; **The Three Who Sing** are secret tunes to unlock gates, silence storms, or sound the city’s memory—only learned by those who swear never to sing for coin.\n- **Saltbinders**: Practitioners who weave knits of salt; they preserve meats, weigh ships, and at funerals, bind grief as salt over the dead’s hands, claiming the heart cannot leak salt.\n- **Riverlooms**: Crafted in the south to weave water patterns into cloth; **water-thread brocades** shimmer like tide in full daylight and like stone in dusk.\n- **Anemocarriages**: Long slope railworks using wind counters; teams haul rope—sometimes whales’ muscle replaced by flesh, sometimes sailcloth—**waiting like skittish horses** when air stalls.\n- **Dreamloaves**: Bread shaped by ‘sleeped’ bakers; they taste like memory and cause gentle visions; disguised as charity loaves, they double as minor fortune-tellers.\n- **The Elm Blight**: A slow-rotting curse in parchment and oak—leaves of stories curling and crumble; towns fight it with ashwater, salt, and reading circles; abbeys argue whether reading aloud is worship or sacrilege.\n- **The High Candle Room**: Inside citadels, a chamber with oil-fueled lamps that never die; **the light hum is believed to record the bell cadences** of past ages, and some claim it answers to names spoken long after the original bell is gone.\n- **Widow-Wardens**: Women appointed to manage land when heirs are missing; their custom cord belts bear knots of oath and are legible only to those who learned river-speak.\n- **The Pale Herald**: A traveling runner whose flag bears the white wolf’s jaw; **his bell cadence never repeats**, and he appears only when the world’s lines tilt, whether for famine, war, or a saint’s emergence.\n\nFinal image to linger: In the market square, a cooper’s hammer taps a rhythm steady as the river’s heart; a saltbinder taps a knotted cord into a ship’s rope; a riverweaver watches glassy water to guess the day’s bargains; bellwrights polish their bronze as if they hold the sky in their palms; a widow-warden ties an oath-knot with practiced ease, her hands moving like the reeds in wind. **Medieval life here is not just stone and rope; it is a chorus of crafts and river-speak where each trade carries a shadow and a light**."
  },
  "beats": [
    {
      "number": 1,
      "name": "Opening Image",
      "percentage": "0-1%",
      "description": "Beat #1: Opening Image – Orchardhaven, at dusk on a cold hillside perched like a crown of slate beside the sea. The roofs are tiled with old copper and patched moss. Lantern smoke trails from chimneys as lamps are lit by hand and tend the dark. In the field below the mill, ale-scented straw smells sweet and stale, and the black loam clings to boots with a sticky, patient grip. Alongside the road, under an iron hook, lies a cluster of unlit iron lungs: round, cold, breathing-like objects set with rivets and etched with simple sigils. They are relic-lanterns. Each iron lung contains a scroll, and each scroll claims to hold one line of a lost law written by the hermit of the hillside—he who keeps an ancient book in a hut beyond the windblown fields. People swear that if the right scroll is placed in the right hands, the dark stone hearts of the tyrant lord will grow cold, and the starblades—rare iron blades blackened by meteors—will be seen shining again across the realm.\n\nAlea Stonewright stands beside the mill. She is nineteen, apron dark with flour, sleeves rolled past her elbows for the unwashed wool she scrubs in the stone trough, the water marbled like a dead fish’s belly. She is the farm’s little fire: the one who keeps the boil and the gossip steady, who listens when others only nag. She does not speak of her father often and never of the nights when he rises to rake the hay with a sing-song and then sits at the edge of the roof to stare out to sea. Today, her uncle is fretting like a moth at a candle, because Lyrian—her older cousin, all jaw and stubborn grace—caught a fever and cannot leave. The lord’s riders came twice last week, searching the barns and counting their sacks of grain, and the old women whispered in the eaves that the Earth’s words lay hidden in the hermit’s book, and that if the wrong hands opened it, the countryside would turn to ash. So the families agreed: someone must go to Owynn the Anchorite and bring the book back. The villagers sold a bronze earring for bread. They bought provisions and wrapped them in hemp. They sent Alea, because she knows the stormpaths, because she can keep her mouth shut, and because in moments like these she is brave enough to take someone else’s cowardice in her heart and run with it.\n\nShe straps the bundle to her belt, and the iron-lanterns clink like hollow bells in the wind. The earth below the road creaks with frost; the clouds are a low, braiding. Fear pricks like pins, but more pressing is the hunger in her bones and the dark impulse to go anyway. The urgency is clean and simple: she must deliver the scroll before night, before the riders come again with their rods and tally strings and knives. She starts down the road toward the windblown fields, the iron-lanterns a percussion of small doubts in her hands, the stars already prickling through the cold. She moves like a determined child—head down, breath even, eyes fixed on the tufted grass as if it were a hidden path. It is not heroic, not yet. It is only a girl, still strong in the wrong world, taking an early step into a story that will bend and break her, because the hermit’s book is not the one she needs to carry, and the lord’s riders will not be stopped by a simple refusal. This is her “before.”"
    },
    {
      "number": 2,
      "name": "Theme Stated",
      "percentage": "5%",
      "description": "Rain sweeps the ridge and drives the last birds into the lichen-dotted stone of the dell, and Aric crouches in the hawthorn as the torchlight of a convoy snags on the flags of the Crown Lord. Cold clings to the edges of his mail, and heavier still sits his failure: he slipped the watchers, reached the tower, and saw for himself that the message is a single metal rod, unremarkable, now borne down toward the tyrant’s fortress like a piece of scrap. Anger grips his jaw—he chose a path of secrecy when boldness might have kept the message safe. Shame knots his stomach because his brief bid to step out from Ben’s shadow into the lifting of hope has already withered. He turns back to the moor, heart low, the clatter of iron on stone a drum for humiliation.\n\nIn the lee of a wayside shrine he finds Mara the hedge-woman waiting beneath an elm that has learned to drink stone. She is old and salt-faced, hands warmed by a satchel of herbs, eyes bright as flint in the rain. Her cheeks flush when she sees his set mouth and the bleakness in his eyes. “You look as though a dire wolf has kissed your brow, boy,” she says, voice edged with a soft grin. “Tell me the rod is on its way; tell me you didn’t dash at a wall like a young deer at winter ice.” Aric’s throat tightens. He cannot bear her pity, yet he cannot lie. “It goes to the fortress,” he says, each word feeling like ice in his chest. “He’ll have it before moonrise.”\n\nMara reaches into her satchel, draws a small clay lamp thick with soot, and strikes a spark from flint and steel. The flame shivers and steadies, and in its quiet light she opens her palm and shows him a slender scroll bound in leather—an older fragment, crafted in a time when such things could speak of hope without a tyrant’s ear to catch them. She does not unroll it; she merely lets it rest in the lamp’s glow as though to keep it warm. “There are many such small things,” she says gently. “A candle in a window, a word pressed into a child’s hand before sleep, a candle burning where it shouldn’t. The Crown Lord gathers what he can, he dulls steel and breaks swords, he keeps his quiet to sharpen his own knife. But he cannot sweep up every seed that spills when men make a torch.” She smiles and, for the first time in hours, Aric feels his chest loosen a notch.\n\nThe implication is a thread drawn out and set against the dusk: not every hope is a rod of brass, not every act of resistance is a blaze at the fortress walls. The deeper truth is stitched quietly here, under the elm and the rain, in the stubborn steady of a small light. Aric’s face flushes—first with shame, then with the hot anger of one whose loss is being summed and damped and held up as a lesson. “So he’s taken it,” he says, voice low and raw. “And I’m left making candles while he sharpens his blade.” Mara’s eyes soften with the sorrow of one who has watched many make the same misstep and pays for it later. “Not making candles,” she answers. “Keeping them lit.” Her voice is firm. “Take the lamp, Aric; warm your fingers. Hope is a long road, and sometimes a boy must learn that this is only the first bent.” He takes it because it is real and warm and the small, stubborn flame argues with the wind, and with a shiver inside him that says the promise hasn’t ended because this task has. The rain grows heavier, and the moors tilt into night, and beneath the lamps’ light the medieval world feels both fragile and stubborn: the tyrant's towers and banners loom, but the candle refuses to go out, and so the seeds of hope still slip between the fingers that would try to bind them."
    },
    {
      "number": 3,
      "name": "Setup",
      "percentage": "1-10%",
      "description": "**Beat #3: The Set-up**\n\nRain sweeps the ridge and drives the last birds into the lichen-dotted stone of the dell, and Aric cuts another twisted, blighted branch from the ancient honey-apple tree. His knives are dull against the gnarled wood, and the wet rope slips through his raw-boned hands. Each lifeless branch he tosses to the burn pile represents another piece of their failing orchard—Orchardhaven, they call it, though it produces little more than bitter fruit and bitterer memories. Master Hawken, his uncle and the orchard's lord, watches from the doorway, his face set in its permanent line of worry. \"We'll not make the winter tithe if this keeps on,\" he mutters, the words carrying the weight of their inevitable doom. Aric's aunt, Mera, bustles about their cramped hut, mending worn clothing and scrimping every copper from their meager stores, but even her needle cannot stitch together their desperate fortunes.\n\nThe local Baron's men came through three moons past, their black-cloaked forms cutting through the morning mist like ravens, demanding their thrice-forgiven tithe from every tree that still draws breath. Aric had clenched his jaw and watched them ride away with what little wine and honey they'd managed to save, his hands burning to draw steel instead of merely wood. His uncle—stern and practical, having survived three lords in his lifetime—shakes his head at such foolishness. \"Steel don't keep a man alive, boy,\" Master Hawken says, his weathered hands steady despite his words. \"Knowledge keeps a man alive, and cunning, and knowing when to bend so you don't break.\" But Aric can feel the old stories stirring in his blood—tales of knights and kingdoms, of battles won and wrongs righted, of purpose beyond the endless cycle of scraping survival from stubborn soil.\n\nIn the little used barn, tucked beneath a pile of rotting sacks, Aric keeps his grandfather's armor—two plates of hammered iron and a sword that hasn't seen oil in twenty winters. Not much to inspect a knight, perhaps, but it's the only honest steel in all of Orchardhaven. Sometimes, when the rain pounds the thatch and his uncle's worry keeps him awake, Aric drags out the armor and just looks at it, remembering tales of his grandfather's service to a long-dead baron, how he'd died defending a bridge against raiders from the Thornwood Marches. It's not that Aric hungers for death—he longs for something harder to name, the thing missing from his days that fills him with such restless yearning that even sharp steel and honest labor can't settle the ache in his chest.\n\nAll evening, the communication crystals his grandfather left hidden in the barn sing softly in the rain—a gentle harmony that speaks of distant voices calling for aid, of a great wrong that needs righting beyond the borders of their valley. But Aric doesn't dare acknowledge them, not yet, not when his uncle needs every hand to tend the dying trees. He helps Mera with the evening meal of thin porridge, gathers wood for the fire, and tries not to listen as the crystals whisper promises of adventure, of glory, of a purpose larger than a failing orchard and a lord who cares nothing for their struggles."
    },
    {
      "number": 4,
      "name": "Catalyst",
      "percentage": "10%",
      "description": "**Beat #4: The Catalyst**\n\nThe world shatters with the metallic scream of a falling star. Aric Thorne presses himself into the moss-slicked stone of the dell as something crashes through the thorn-trees above, trailing smoke and sparks that illuminate the dark like dying embers. The object—twice his height and shaped like a great stone egg wrapped in bands of copper and obsidian—lies broken in the shallow crater it carved, its surface etched with runes that seem to pulse with their own sickly light. The rain slashes through steam rising from the wreckage, and Aric's heart hammers against his ribs. In his distant cousin's stead as keeper of the outlands, he should investigate, but the thing whispers to his bones in a language older than memory.\n\nFrom the cracked shell steps a pale, shivering figure—the size of a child but with eyes like winter stars—and Aric recognizes her at once: Sera Thistleraine, the Princess of Ironhaven, whose portrait hangs in the village square. She staggers forward, clutching a fragment of crystal the size of her fist, its facets catching and fracturing the weak moonlight. \"You,\" she breathes, her voice carrying the weight of desperation and command. \"You're the one the old seer spoke of. The line must not end with us.\" She presses the crystal into Aric's palm, and heat races up his arm like fire in his veins.\n\nThe crystal awakens, projecting not light but shadow-pictures that flow across the stone walls like ink in water: Ironhaven's towers falling like sheaves of grain, the Dragon-spires of the Dark Lords crackling with eldritch fire, and a great fortress—the Bastion of Shards—rising from the sea like a black tooth. \"They destroyed it all,\" Sera whispers, her face a mask of grief and rage. \"But there was one who escaped—the last of the Bladekeepers. He spoke of a hope hidden in the songs of the old gods. And he spoke of you.\" The vision shows a figure in tattered gray robes kneeling in rubble, speaking words that make the ruins themselves weep blood.\n\nAric's ordinary world—his orchards, his quiet duties, his careful avoidance of the wars that rage beyond the valley—crumbles like fallen leaves. The crystal grows heavier in his grasp, pulsing with the heartbeat of his ancestors. \"I am no hero,\" he protests, but even as he speaks, he sees in the shadow-pictures the truth: that if hope exists, it burns like fire in the darkness, and that fire has found him in this rain-swept dell. The old seer's words echo in his memory—the blade that was broken must be reforged, or all will be consumed. Sera's eyes lock with his, and in them he sees the terrible weight of hope and the cost it demands. The story question burns in his mind, clear as flame: Will he seize this impossible chance, or let the last ember of hope die with the falling star?"
    },
    {
      "number": 5,
      "name": "Debate",
      "percentage": "10-20%",
      "description": "Aric cradles the cold, dented orb—a shard of the star that fell, carved with patterns like pages of a language that isn’t his. He kneels at the threshold of the dell, where the rain has streaked his cheeks, the ridge behind him dark and watchful as an unyielding king. The library of the sky-monk lies in ruin; the monk is gone; the bell that rang is a mouth full of silence. Two young ones look to him with dirty faces and hungry eyes. He could take the star-home back up the ridge and back to his life—barrels of ale, sweeping floors, a morning of clean water and work; or he could turn his back on this little valley and carry the thing to the distant seacoast where the village memory says the old Order holds a rumor of an Order—the last ones who might decode it.\n\nHe runs his thumb over the grooves and wonders whether the message is mercy or doom; whether it is hope or the last herald of the night. He has heard the songs. He knows how kings and their forged weapons go. In the dell he has bread and friends and his sister’s memory. If he leaves, the dell could be spared—or it could be taken from him. If he stays, perhaps someone wiser will come. Perhaps the star will fall asleep and never be noticed again. The scholar’s lantern is still burning across the river, and he thinks of the monk’s last warning: do not let it fall into iron hands.\n\nAric’s fear is a cold knot at his throat and a heavy weight in his gut. He wants to trust the laws of distance and time. He wants to trust that somewhere else will take the burden from him. He does not believe in war. He does not believe in change. And yet, the light flickering under the closed door of his mind says a different path is possible: that another path could cost less than nothing at all. The torn map scrap on his palm is too precise for a joke.\n\nHe sets the orb down and lifts it again. He checks the sound of the river; he looks at the muddy tracks of hooves, at the field beyond the dell where the last birds still cluster under eaves and hawthorn. He breathes as if counting each breath down to the last. He wants to ask the dead to tell him what to do, but the dead only sway in the grass. Then his sister’s voice comes at the memory: we cannot choose not to be chosen. Aric steps forward, a small clumsy boy of iron, toward the road that leads from the dell and away from it."
    },
    {
      "number": 6,
      "name": "Break Into Two",
      "percentage": "20%",
      "description": "The courier was waiting in the stone-arch under the road where the mist hung like moss, hood pulled low, hands bony and quick. The smuggler’s grin flashed once—more gap than tooth—and then went away. “Two paths, Aric Thorn,” he said, voice thin as parchment. “Deliver it to the Castle and pray the Prince’s men are not the sort who take everything and burn the rest. Or bear it west to the guildhall where the smiths will temper it into order—among equals, for equal good.” He thrust a leather satchel into Aric’s hand, smelling of rope-tar and old cheese. “For your village’s sake, choose well.”\n\nAric nodded at his burned roofline and the blackened stub of his own plow in the field. He had carried that broken handful of star-shard all night, its carved grooves cold against his palm, the pieces of writing odd and incomplete, like a prayer half-memorized. Every blink showed him the flicker of fire and the sound of iron clapping over bone; every breath tasted of wet ash. He thought of his dead mother’s ledger-of-debts and his name scratched under the debt-collector’s list. He thought of the lords’ taxes that would not wait, of the two families gone from the cottage on the rise when the falling star struck, their bread salt-stained with fear. A knot tightened behind his sternum. He wanted justice and he wanted the pain to stop. He wanted to not be the man who simply took, who ran, who failed.\n\n“West,” he said. He pushed the courier aside and took the reins of his patched gelding, an animal with more patience than sense, and rode toward the valley where the guildhall hid like a fox in its own hill. Lightning cracked and rain stitched his cloak to his back. Every step took him from the ridge where he had tended the sheep and the black shape of the wagons which brought law by rope and boot—into a land where the rules were upside-down: bread learned to whisper under knives; stallions neighed like silenced bells; the sky hung heavy with the smell of iron-mist. He had promised hope, not heaping power into hungry hands. He had promised light, not a vein of bright cruelty for tyrants to mine. But the dark tasted like a shield and the men of the guild were not afraid of him, not the way the lord’s soldiers had been when he lay on the ground, money in a satchel for a week’s peace. He had chosen not the prince who could make war by a word, but the guild that promised fairness, a seat at the table that felt almost like a family. It felt noble. It felt like survival. It felt like the right thing to do. And because his heart was still full of fear, and because he had not burned that fear into truth, it felt wrong as well.\n\nAt the hilltop’s end the valley opened into a basin of old cottages and stone walls like spines. The guild banners hung limp, but the men in their black and red tunics were hurrying, faces pale with excitement. One man with the black guilder’s ring on his thumb dragged a sled down a slope toward the guildhall, where iron chimneys and a smokestack the color of ash cut into the sky. He would be the one who fixed the shard into the heart of some engine, the courier had promised. Aric dismounted, hands shaking, eyes empty of mercy or cowardice, only an ache for the way things used to be and a stubborn hunger for a better world he could not yet spell. The bridge he had to cross—a rope-and-plank thing strung over a gorge—hung low and swaying. He looked at the river below, dark and fast, then at the shard, then at the valley’s peculiar, clean-cut edges and the new white scaffolds sprouting like bones. The cold was not the wet cold of the storm anymore; it was the anticipatory cold of a blade being tested. He stepped onto the bridge. One rope creaked. The gelding snorted and stamped. Aric did not look back at the cottage that had once been his, nor at the way he had turned, nor at his face in the storm. He did not listen to the rebel monk’s hard whisper or the mendicant’s mercy or the font-marked old lady’s riddle. He walked because walking had to happen. He walked because he could not bear to stand still and do nothing. He crossed, and with each step the world turned beneath him, and he was no longer the shepherd on a ridge, but a man who had chosen to step into the upside-down realm where hope was a coin that bent in his hand, and where choices did not ask twice."
    },
    {
      "number": 7,
      "name": "B Story",
      "percentage": "22%",
      "description": "The mist thickens as Aric steps under the stone arch and finds the courier waiting, a young woman in the Hearth Guild’s grey with a travel-worn satchel and a face dusted with ash. She looks past him to the red-flecked sky and speaks with the habit of someone who has learned to count danger in breaths rather than counts: the star is down, the smithy gate is shut, and the Dean’s metalworkers already have it locked behind iron. Her name is Maia, bound by oath to the monastery archives; the courier’s roads have become the only ways the old scripts can still move. She presses a sealed waxed packet into Aric’s palm, the seal of the Dawn’s Keepers pressed with an oak-and-star; it is a message, a song-map that must be read by a scholar, a tradition older than law. She is not here for rumors; she is here because hope now comes in threads and not banners, and those threads must be kept from snapping in hands that serve the iron king.\n\nAn old man steps from the shadow of the arch, his robe frayed at the hem and his beard rough with dust. He calls himself Ben, though his real name is gone to battle and time. Ben’s eyes are pale in the firelight and he has the long memory of someone who remembers when star-maps were drawn on parchment, not hammered into tools of war. He takes the stone orb from Aric and runs his thumbs along its dents and grooves as if listening, his voice low and steady: the falling star is not a sign of doom but a key; its patterns are written in the ancient tongue of the sovereign star-callers. Every rise and recess, every notch and facet, points to vaults sealed when the old line fell—seed vaults, record vaults, reservoirs of knowledge that can grow a country again if restored. The abbey learned this years ago and hid what they could. Tonight, what remained will be open to the light once more—unless the smithy drags it deeper into the mountain.\n\nA third figure moves out of the lean-to beyond the arch: Jaren the Bond, furred hat, oil-smeared leather, and a grin that remembers every law he ever bent. He swears like a man in a hurry but stands like a man who understands pressure. The city will see the star as a trophy, he says, and the Dean will call it proof of his stewardship. It will be parsed, melted, and reshaped to make their iron banner sing when raised at the end of a spear. Jaren laughs and then does not, because he knows that the banner’s song is also a tower to be climbed. He will move goods at midnight and open routes at dawn; he knows where the water sluice is, how the smithy caches iron, and where the master smith sleeps. What he needs is a voice from the abbey to make the watch hesitate: a weight of old law, a line from a child’s primer that will make a guard remember that he was once taught to serve people and not swords.\n\nPrincess Liora waits beyond the leaning gate, under the drip of the old abbey’s eaves, holding a scroll bound with reed cord. Her hair is braided with river grass—mark of the riverborn, of memory that braids rather than burns—and her eyes are soft with grief and sharp with purpose. She is the last scion of the old line, without court and without kin, but she is the living tradition of the vaults. She tells Aric what the courier cannot: the message in his hand is not a plea but a starting hymn, a key that Ben will read aloud and she will sing to men who have forgotten what their hands were made to do. She asks him to carry her voice to the smithy door at dusk, to say the law’s old clause aloud so the gate will hesitate and not swing wide. In this medieval city where hope hides in scriptoria and smugglers’ sidestreets, Aric’s B story is the fragile alliance of a monk, a princess, and a smuggler—hope braided by old words and new roads, a fragile chord that he will be asked to strengthen. And if his hand shakes and his words falter, if he walks the wrong path or hesitates too long, the light of the fallen star will go dark again beneath the mountain, and his own failure will be a part of that silence."
    },
    {
      "number": 8,
      "name": "Fun and Games",
      "percentage": "20-50%",
      "description": "Aric and the courier slip out of the archway into a fishing town whose chimneys breathe pine-smoke into the evening, the river scored by oars and the clatter of iron. They find a Warm Oak tavern that smells of tar and fresh bread, and the town clerk posts Aric’s dented orb on the notice wall beside a folk-tale of a fallen star with starlight woven in its seams. Aric feels a quickening in his chest—he has heard that name before, the Wanderers of the Long Road, but this time it sounds different, as though fate has threaded the old myth through his fingers. He reaches up and strokes the cold shell of the orb, half expecting it to answer; the carved patterns seem to pulse when he stands beneath a lantern, and a whisper of a melody slips out, a tune like wind over water. He takes it as permission to trust.\n\nInside the tavern, the courier—whose name is named only when it is needed—introduces him to an old cartographer with ink-stained nails who claims to have walked the road the star-tellers sang about. He spreads a parchment of old kingdoms across the table, points out rivers that now bear salt, and names the arc of constellations the orb points to in the smoke. Aric leans in, breathing the old words like he could swallow them whole, because for once the ruins of his own past don’t feel like a question without end. He drinks the steam from his bowl, laughs with a warmth that surprises him, and calls the orb his wager against a world that has taken everything else.\n\nThe fun and games gather steam the next morning in the town’s barracks behind the smithy. The captain, a woman whose voice cuts like a scythe, tests Aric with a worn sparring sword, and the courier demonstrates a brisk old-silver grip she learned in her father’s manor. The beam from Aric’s orb—always a ghost-light until he forces it—snakes out against the grey sky, and for a moment the pale cord quivers like a willow-branch before fainting to nothing. The captain presses him; Aric blocks, batters, moves like he believes his life depends on it, but he keeps glancing back to the orb’s carved seam. The page of patterns flows when he looks; it fades when he doesn’t, and every shimmer shows the world he wants to live in: a field of green banners under honest suns, scholars who can read the star’s missing chapter, a road not blocked by ruin. He holds his sword steady and knows the weight of the orb in his cloak is both comfort and proof of his weakness.\n\nBy evening the jolly humiliation sets in. The town bailey brings him a promise—deliver a petition to the King’s court in Crownmarch with the orb’s pattern as proof, and the King will grant a trial of the old arts at dawn. Aric’s heart knits itself into a banner; he says yes before his mind can stitch caution into the reply. He sleeps with the orb beneath his pillow so tightly that his chest aches with the wish that morning will mend him. The courier says nothing, but her breath in sleep goes shallow, and Aric wakes at first light already preparing to fail. He lays the orb on a board, presses his fingers to the seam until the light gathers and breaks like thin ice, and the open-air court goes still and expectant. Aric steps forward and slams his fist into a move he knows, but the orb refuses, the patterns flatten, and an old man leans forward with a knowing laugh. The captain watches Aric flinch and fail at the very threshold he hoped would rebuild him. He walks away lighter and heavier by the same weight, a little less whole and a little more like the story he swore was different. The promise of the premise—that hope could survive and the orb could be read—was entertaining enough to taste, but the world he has entered has no patience for his excuses."
    },
    {
      "number": 9,
      "name": "Midpoint",
      "percentage": "50%",
      "description": "### Beat #9: Midpoint – A Light That Fails and a Seal That Binds\n\nThe port council grants Aric a single audience before the Harbor Watch, convinced he holds the missing cipher that will pry free the lines of supply that feed the Watchtower’s hold. Aric presents the courier’s fractured parchment and the gold sigil as proof; under the vaulted rafters of the council hall, a clerk pale with fear examines the documents against the hall’s ancient wall records, only to declare that the ink’s hue and the pressure of the seal do not match the official standard. The room tightens as the mist outside turns greener, the mooring bells chafe, and the tide hardens toward a flood line that will lock the harbor gates at dusk. Aric’s back goes rigid; he refuses to back down or apologize, arguing that the city’s logic is a straightjacket and that men make their own truths, his voice charged with bitter defiance rather than humility.\n\nWhat should be a victory becomes a rout. The courier—whose hands never stopped folding and unfolding the maps in her nervous ritual—hesitates at Aric’s elbow and tries to pull a smoother thread from her sleeve: a copy of the cipher scrawled on scrap oilcloth, better than the one they carry, a quiet hope too late to be official. Aric snaps the oilcloth into the clerk’s ledger, an act that looks like sabotage, and the council shouts for the guard. The harbor bell clangs; watchboats glint like sawteeth across the estuary; oars rise and fall toward the council stairs. Time clocks chime both in the tower and in the crowd’s heartbeat; by dusk the flood will freeze them in the harbor, and by dawn, the Ravens will be overhead like a storm of iron.\n\nAric lunges to make room, the mirror-scabbard biting his knee. He snatches up a hook and flings it at a taut sail, tearing it, thinking chaos will buy them a moment. Chaos buys something else entirely: a code-bearer held in the back rooms is dashed free, only to be slammed into a pillar by a guard’s mace; the printed word is spattered with blood. Aric makes it to the end of the quay, but the courier’s broken breath proves she cannot sprint. He leaves her, choosing escape over protection. The courier calls his name once. He turns, not with a vow to return, but with a final pronouncement about honor and hope that rattles even himself: “Even if it was true, it never mattered.” His refusal to grow—his steadfast choice to make sense through isolation—bites deeper than any chain.\n\nFrom the Watchtower’s ribbed silhouette, flares are struck and the Ravens are called down from the air. The harbor gate chains rattle as the tide keeps its own counsel. In the council hall the ledger snaps shut on Aric’s name, and the court scribe begins a tally of fines and taxes meant to crush the harbor’s will. The courier clutches the torn oilcloth, not believing Aric’s words, but believing in the path he broke by his anger. The midpoint tilts: what might have saved them—the heraldic truth, the fleet of fishers, the map among them—curdles into accusation and distance. Aric has neither the seal nor the city’s trust; he has only the bleak confidence that people fail and that light can’t outlast his own bent."
    },
    {
      "number": 10,
      "name": "Bad Guys Close In",
      "percentage": "50-75%",
      "description": "Aric sees the star-shaped siege fortress rearing over the bay like an iron moon, casting a pale shield over the water that swallows stars. Before dawn, the port’s gates slam shut and spiked chains run the streets. Helmets bloom on every corner. Hunger shows first: the port council changes the bread ration to slivers of ash-dark crust, and the miller mutters under his breath that “hope is taxed.” Aric is posted on the watch bridge with his own men, the courier beside him counting breaths. Even the sea seems backed into the harbor by oars and iron. The watch captain lowers a curved iron visor and speaks through the slit. “The ordinance binds the High Road from dusk to dawn. No one in, no one out.” Aric counts the priests outside the council hall with their grey-wax seals; their bell-chain rattles with each new proclamation. Mist that once whispered their passage now clings like hands. Aric presses his palm to the cold stone and feels his heart thud against the old oath he swore to keep, as if the fortress itself has taken a breath and held it.\n\nInside the inn, a traitor whispers with a silver coin beside a pot of stew. The courier—young, bright, and stubborn—doesn’t see the hand slipping a writ into the pouch on her belt. Aric does. He steps too late to stop her before she meets a council runner in the lantern-lit stairwell. The runner pulls the writ free with a practiced twist and slips down the shadows like a fish. “He made me promise,” she says, her eyes watered but steady. Aric’s jaw tightens. He has carried hope like a relic across mist and bad luck and lost a brother to keep this. “We swore together,” he says, but the swear strains under the tower’s shadow and the clank of armor in the yards. The courier looks at the smoke curling from chimneys like prayers. She nods toward the iron-banded door. “Then we choose what we keep.”\n\nThey split anyway, as pressure calls forth every fear Aric carries. A handful of his men take a side street toward the market well and find six archers waiting, caps of black feathers pointing at the sky like mourners. Another boy from the gatehouse slips away to the docks and comes back with a fisherman’s soot on his cheek and a mouth full of simple words that sound like exile. “No mast will cut the chain tonight,” he says, shaking like a spearpoint. Aric does not yield. He rallies a small charge in the night under the watchtower, meaning to seize the chain-gate before midnight. Men die badly—two cut down by the watch captain’s blade, another dragged under by a watchman’s rope and sink. Aric earns a harsh stripe across his ribs that glows in the dark, and he stumbles back into the inn with a spear stuck in his boot and none of the confidence he had in his palms before. He has chosen motion over judgment; it was a choice that leaves bodies and nothing else.\n\nDawn finds the fortress still above them. The council seals its writ to the city gate and the market squares. By law they must surrender whoever bears the courier’s sigil, a broken flower stamped in wax. Aric stands at the corridor’s end and sees the courier step forward, the cord knotted at her throat, the coin in her purse cold and heavy as if it were made from regret. She looks at him not with anger but with a kind of peace that wounds more than a blade. The bell of the watchtower tolls seven times and a score of heavy boots draw near. Aric does nothing—not to push her back, not to fight, not to run. The pressure is outward, and the pressure is inside him, and the net is the shape of his failure. The star-shape fortress holds the bay, the chain holds the sea, and Aric’s heart holds a vow he cannot carry. His men are scattered, and the hope he promised to protect turns its face away. He has failed both outwardly and within, and the enemies close in."
    },
    {
      "number": 11,
      "name": "All Is Lost",
      "percentage": "75%",
      "description": "### Beat #11: All Is Lost\n\nAric staggers back into the fishing town just as a cold silver wind starts pulling at the flags. Smoke spills from the bell tower he once trusted to count his sins and his mercy. The port council has handed over the Seal of the Archway—carved from the same white starstone as the rebel sigil—into the iron glove of the star-shaped fortress called Nightspire. In exchange, the council called a truce, thinking they could buy time with a token of purity. The door they opened was a throat, and Nightspire swallowed it whole.\n\nAbove the bay, the siege fortress hovers on chains and pulleys, a jagged iron moon with lanterns like torn stars. From its belly pours a wave of pale fire—nothing normal, nothing normal. It sweeps over the rebel village of Asterfell across the water, not as flame but as the absence of song, as if the world were swallowing its own breath. The houses shrink to chalk, then fade. Bells ring once, then are gone. The cheers in the fishing town cut off as though stringed. Aric watches his last hope get wiped like a sketch in sand, and nothing he has done matters. The message he carried, the secret seam stitched into the envoy’s cloak, the fragile plan for sewing Nightspire’s own design against it—all of it collapses the way castles do when you take out the first stone.\n\nHe sinks onto the damp quay beside Lir, who is still breathing but not alive anymore. The courier’s eyes are blank, no word left to carry. The trap in the archive chamber was a net woven from oaths. When Aric reached for the Seal, the very power that would have saved the town leapt to claim him. The black furnace of the fortress sent a rope of oathfire up the council’s chain, and where it touched, a vow turned into shackles. Aric burned and burned, and the blaze went out anyway. He remembers the night he stared up and made a boy’s promise: light over tyranny. The words are in his mouth still, but they taste like ash. He failed the oath, failed his people, failed the light. He didn’t grow stronger, only smaller. When he drags Lir to a torn awning and watches the courier’s throat fail around the final breath, the thing that dies is Aric’s stubborn certainty. The world is an iron moon. Tyranny has made a proof. And he has nothing left to throw against it."
    },
    {
      "number": 12,
      "name": "Dark Night of the Soul",
      "percentage": "75-80%",
      "description": "### Beat #12: Dark Night of the Soul\n\n**Aric drags his battle-worn cloak back into the hollowed town, his breath a fog that the cold wind scours into the shuttered streets, and he stands in the ashen courtyard where he once delivered grain by hand to the council granary, now broken and choked with iron dust.** The Iron Moon rises in the sky, its star-shaped battlements stitched across the winter fog like a wound, and the water gurgles black around moored boats that look like the ribs of some drowned beast. He touches the charred stump of a shrine tree and hears the slow drip of tar from the torches still clinging to a gallows that the Imperials left standing as a lesson. A messenger waits with a thin board inked with the seal of the port council: a small sin assigned to him for the good of the town—death will take all in the end if the tithe is not paid, and he must swear to the dying light of a hope he no longer believes he deserves. **He cannot fight the Iron Moon, cannot unmake the star-shaped seal the traitors sealed over the bay, and cannot restore the lives he failed to save, so he breaks the board over his knee and speaks the words anyway.**\n\nHe goes to the harbor to look for a way out and finds a small handcart waiting beside a cracked water barrel, dusted in salt and cobwebs, with a folded patch of cloth bearing the sigil of an old village ballad—an eight-pointed star, the memory of a village that once tried to record the shape of hope so that sailors could find land in bad weather. Aric unwraps it and finds a brittle strip of bone from a temple wall, split and scratched with old runes: “When the Iron Moon rises, look to the Black Gull’s Nest to see a mortal star burning against the dark,” a relic that came to his great-uncle from some forgotten mission, and the old song begins to form in his mouth with a certainty that makes his jaw ache. He thinks of the midsummer and the night he sneaked into the council cellar to trade pickled eels for paper; he remembers the tree-scribe’s whisper about the star-maps in the foreign volumes that the Imperials burned; he hears his own name grow small as the wave-voice answers back. **There was a moment, he knows, in the fighting where he could have cut a different path or held a different line, and that choice has already delivered him to the ashes that line the roads.**\n\nHe counts the lives lost and knows them by their faces: the boy with a scarf who still believed in the gull’s nest legend, the old woman who called him by his mother’s name and demanded he become something greater, the fishermen who dragged his boat back into the bay without asking for thanks. He looks at his sword and thinks of setting it down in a cold church and leaving town forever, wandering the roads as a hired guard or a mercenary, a man without a story and without a cause. He breathes again, though the air cuts like knives, and the note of the star-song rises above the rush of wind, promising one last answer, a way to make the Iron Moon tilt or turn, if only there is someone left to carry the promise. **He does not grow to light or hope; he bends toward a shadow and learns the shape of the dark, resolving to become the kind of star that burns without warming, a star that burns, sacrifices, and vanishes.**"
    },
    {
      "number": 13,
      "name": "Break Into Three",
      "percentage": "80%",
      "description": "### Beat #13: Break Into Three\n\nAric has dragged his cloak into the hollow of the town, where the night smells like damp rope and cold iron, when the Squire’s ledger-knave—Old Cael, the chronicler—stumbles into the watch-house with the splintered end of a frost-bitten carrier pigeon jammed to his wrist. His message is torn by ravens and sea-salt, but the rune he pinches out in ash reads like a prince’s coin: the siege-fortress drinks fire through three great louver throats, and when the south wind turns it inhales smoke like a whale, air flaring hot from its belly; there is a culvert where the storm-lake drains, a kink in the iron, and the weakness for a merchant’s bolt is carved by a blacksmith’s hand.\n\nAric hears the truth not as a rule but as the hammering of his own forge once more, slow and sure; he straightens his spine and the ache becomes a knotted power, not relief but reason, an arrow spun and pointed. He remembers the night when the Star was not a shape but a sky, when his hammer sank straight through a coin and the king’s armorer said, Strike where the forge groans, not where it sings; he thinks of Ged the ferryman who knows the bay as a palm, of Stela the rope-wright and Ran the barrel-maker, of the cloistered goat-boy with coal-bright eyes who whispers there are draft ladders up under the west tower where the muddlers climb; the town is ruined, the tyrants are near, yet the quiet places are always the place to start.\n\nHe walks out of the watch-house with the chronicler’s message folded into his wool, not a saint with a word but a smith with a ledger; his tears are gone and his jaw is set, because every legend begins with a name and a plan, not with a fall, and for once he chooses the place where pride cracks instead of people. Aric summons Ged to bring the rotten barge up from the reeds and fetch Stela’s tar cauldron, then he bows his head at the stairs of the cliff-chapel to ask only for mercy, not success, because Act Three begins with what you choose to do when no one can tell you what happens next."
    },
    {
      "number": 14,
      "name": "Finale",
      "percentage": "80-99%",
      "description": "The bell-tower of the coastal keep is a hollow throat of stone; Aric drags himself up the spiral within, shoulders burning, cloak fouled with salt and blood. He has taken the Wind’s Oath, the old words his father muttered at the kiln mouth when the storms were too fierce to fish; he speaks them now to the damp air, tries to bind the gale that rolls off the black stone of the garrison’s dragon‑cannon, but the wind holds its breath. Baine’s jest comes back to him, and then the scribe’s last words, and Aric’s own lie: there is no hand or light here. Only his. He steadies, feeling for the taper already lit in his fist, for the way he practiced with the nightbound stones, for the old rhythm of strike and water, burn and quench. The tower listens. The iron cannon beyond the loophole snorts again, the whole city trembling like a beast under a rider’s spurs. Aric presses the flame to the tinder and lets it go, knowing—knowing with the weight of all he has done wrong—that if this fails there will be no other.\n\nAric, Sir Garrett, Lady Leiora, and the rescued townsfolk spill into the old forum beyond the cannon chamber, shoulder to shoulder with archers from the inland holds and fisher-knights with knives and clubs. Duke Morgath waits there with a brace of halberdiers and the governor—hard-eyed old men in the tyrant’s colors—and their eyes flick to the tether of flame flickering up the tower as if that faint thread were the last stitch holding the city whole. “Yield,” Morgath rumbles, “and the rest live. Or burn for the right to be foolish.” Leiora’s jaw sets; the steel of her voice is the only thing that can cut through fear. “Hope is not obedience,” she says, and leaps at the soldiers with nothing but bone and nerve and fury, as if one small figure were enough to turn the tide.\n\nThere is a blurred ring of steel and splinters, and Aric tries to be Baine’s careful teacher of edges and posture, to be Garrett’s stone-hardness in the press, to be the fisherman his father made—but Baine is a soul on the pier, his father a wreck buried under iron, and he is only what he has been: a boy who ran, a man who lied, a hand that knows the heat of the kiln but not the cold of the star. A spear takes him beneath the ribs; Garrett drags him to the shade of a broken arch, and Aric can only watch, over Garrett’s shoulder, as Leiora disarms one of the halberdiers and kicks his knees out, and then the tower roar ends in one long, ugly yelp that echoes like a warped harp string—the dragon‑cannon has at last fired. Leiora whirls and points, her mouth forming orders for the archers, and Aric presses his own eyes shut and waits for the sound he knows will come.\n\nThe stone of the forum shivers, split by a moon-thick column of fire from the keep: the dragon‑cannon breathes; the last of the harbor village roars skyward into ash. Leiora’s eyes, in the moment between breath and bone, meet Aric’s, and in them he reads the old question the hamlet asked when the ships were sleek and the skies still clear: Will hope live? He watches her throat work as if there were something to be spoken, and then the wind he could not bind finally arrives—not to help but to drive the smoke and cinders into the hollow of his mouth, choking out answer and breath alike. The rope of flame above falls silent and dead; the flood of brimstone in the forum does not. The town of Grainfork is gone.\n\nThe last, small thing Aric does is to reach down, trembling, and press the heel of his boot to the glowing fuse Baine’s word-worm left coiled at his belt. He stamps until the tinder is ash and smoke, his heart a thin drum in a cold room. Garrett catches his shoulder and guides it away from the world, from light, from any chance. The banner bearing the dragon‑cannon’s crest snaps above them as it sways on a rent staff, and the winter air smells of iron and rain and the sea’s last salt. They kneel among broken men and broken stone and let the truth fall heavy around them: the Empire has won. In the film it ends with words ringing across the stars; in this gray day it ends with a boy’s breath gone out and a girl’s courage too small to move a mountain. He did not change for the better, and he could not make the change for others. The tyrant stands; the town lies charred; the rope of flame is only a cord burned through."
    },
    {
      "number": 15,
      "name": "Final Image",
      "percentage": "99-100%",
      "description": "# Beat #15: Final Image\n\nAric lies in the throat of the bell tower like a prayer that never rose. The rope is burnt through; the bell hangs cracked and silent, tilted against the throat of stone as though it is choking. He has dragged himself onto the narrow gallery high above the harbor where the black banner of the Keep snaps above the flagpole. His cloak is caked in dust and sweat; his hands are split and bleeding from gripping cold steps; his knees won’t hold him anymore. He has come to the place he thought would make him brave, but it has taken everything he had and left him with a dull ache and a ringing emptiness. Around him the town sprawls in hard gray—the rooftops slick with salt and night, the markets shuttered, the watchfires gone. A servant’s lantern sputters by the wall, but Aric cannot bear the light. He curls his fingers around the iron key he was told to bring, then lets it slide from his palm; it clinks once against stone and disappears into shadow. The world he set out to save still reels under a tyrant’s fist, and he is a small, stubborn thing, pinned beneath the weight of a promise he could not carry.\n\nThe change is plain and ugly. When he first left the village, the wind lifted his hair and the air tasted like turning wheat; he walked with a notion that there was a light somewhere, beyond the ridge or beyond the sea, and that he could be the one to carry it back. He tried to bring the people of the harbor together with stories of old banners and a buried rebel lord who wore a crown without a tyrant’s shadow. He led desperate men through narrow lanes to storm a gate they should have never attacked; he tried to speak when shouting would have been kinder and failed at both. He climbed the tower to signal hope to the watch from the big black ship in the harbor, only to discover the black banner was a noose. The old boy who wanted to be a knight of the field lay crushed beneath a collapsed beam from a bell that never rang. The farmers’ boys he marched to the market are locked in the stocks; their mouths are sewn with iron wire and their eyes are raw with shame. Aric promised bravery and brought only bruises. The town has not welcomed its hero; it has taken his defeat like rain through broken tiles, and the people shelter where they must.\n\nAt dawn, light pours through the gap in the bell throat and washes the tower in thin silver. Aric, too numb to be frightened, watches the black banner above him tremble as if the wind itself is afraid to touch it. He reaches up to touch the broken bell with his forehead, as if the sound left in it could tell him what went wrong. He thinks of the field that fed his childhood, of his mother laying bread on the sill for anyone who passed, of the old boy who taught him to hold a lance steady. He tries to remember the story his father used to tell of a rider whose fire sword lit the road in winter and made tyrants turn their faces to the walls. It feels like another world, a dream he borrowed when he needed courage. He lies with his back to the rope line that would have rung the bell, watches the harbor brig slip its moorings and swallow the tide, hears drums and horns from the Keep as soldiers march through alleys like a storm dressed in metal. He is cold. His bones ache. He closes his eyes and keeps his breath steady and knows he has failed and not grown; he has seen the final image of his effort—a broken knight in a hollow throat, the light from outside beating against stone and being refused. And yet, under the hush, a small stubborn pulse remains: the town will remember him not as a hero, but as a boy who tried, and someone might try again."
    }
  ],
  "characters": [
    {
      "type": "protagonist",
      "data": "{\n  \"name\": \"Cedric Rowan\",\n  \"role\": \"Hero\",\n  \"age\": \"18\",\n  \"primary_want\": \"Deliver the hidden Star of Bryn—the rebel beacon—to the Free Companies so they might strike at the Shadow Regent and free his village of Millhaven from harsh levies and threats.\",\n  \"primary_need\": \"To accept his lineage, confront his guilt over his father’s death, and act on conscience rather than hunger for glory; to learn discernment rather than trust an easy promise of knighthood.\",\n  \"personality_traits\": \"Duty-bound, earnest, and brave by instinct but reckless by pride; devout yet naive, quick to swear fealty to whoever speaks with authority; carries warm loyalty but little skepticism.\",\n  \"backstory\": \"Raised in the peasant stead of Millhaven under the iron rule of Lord Warden Thane. His father, Ser Rowan of Millhaven, was accused of treason for hiding refugee scribe-knights and died defending the village. Cedric swore his father’s blade and wore the broken sigil, chasing the dream of knighthood as a way to restore honor. On harvest-eve, a dying rebel scout slipped him a broken medallion—the Star of Bryn—cracked and no longer casting true night, saying only that the Free Companies could repair it. He set out to deliver it, determined to repay his father’s debt by deed.\",\n  \"internal_flaw\": \"Naive honor; he mistakes obedience for virtue, craving knighthood and easy vows over discernment and truth. His grief and shame make him leap at any lord or captain who offers absolution through service.\",\n  \"arc_summary\": \"Cedric never reaches the Free Companies; the rebel captain who should repair the Star of Bryn is found dead in a bog. Desperate for guidance, he is seduced by Warden Thane’s fair words and a false promise of knighthood. He publicly yields the Star to Thane, believing he’ll restore Millhaven’s rights. Thane quells a small rebellion with the Star, then hunts and slaughters the Free Companies. Externally, Cedric fails to deliver the beacon or free his village. Internally, he refuses to examine his complicity, clinging to hollow ceremony over moral courage. He receives no absolution, gains no wisdom, and remains a decorative knight in Thane’s hall, a tool now masquerading as a hero.\",\n  \"key_conflicts\": {\n    \"internal\": \"Guilt over his father’s death and shame at his peasant birth; fear of being dishonored; inability to discern lies disguised as lordship; self-deception through devotion to ritual and titles.\",\n    \"external\": \"Lord Warden Thane’s predation and manipulation; bounty riders and rebel in-fighting that impede his journey; a rival messenger who kills the only witness capable of confirming the Star’s purpose; corrupt priests who twist oaths; the necessity of crossing contested borders to reach the Free Companies.\"\n  }\n}"
    },
    {
      "type": "antagonist",
      "data": "{\n  \"name\": \"Eamon Valerius, the Steward of the Iron Crown\",\n  \"role\": \"High Sentinel and Imperial Interdictor\",\n  \"primary_want\": \"Consolidate imperial authority by crushing the last freeholds and forging a realm of flawless order\",\n  \"primary_need\": \"To surrender his fear of chaos and admit that command without consent becomes a cage for both ruler and ruled\",\n  \"methods\": [\n    \"Issues sealed writs of interdict that shut markets, silence songs, and snuff out hearth-fires until dissent starves itself\",\n    \"Hunts a ancient navigational artifact—the Starstone Codex—hidden within the ruins of an old watchtower, believing its secrets will bind roads, rivers, and weather to the Crown’s will\",\n    \"Employs stormglass lanterns and tuned chains to map movement across leagues, relying on predictable patterns to rout the scattered freedom-fighters\",\n    \"Gives quarter to defectors, turning traitors into instruments of rule to prove that even courage bends to design\"\n  ],\n  \"flaws\": [\n    \"Confuses command with certainty; every victory tightens his grip until even allies choke\",\n    \"Believes mercy is a calculation rather than a choice, and thus mistakes dread for loyalty\",\n    \"Cannot tolerate improvisation; his schemes fracture when the battlefield refuses to rhyme with the map\"\n  ],\n  \"resources\": [\n    \"The Royal Road Wardens—a disciplined levy that moves in clockwork columns\",\n    \"A cadre of smith-priests who engrave edicts into iron filigree, binding oats, salt, and soldiers to sworn timetables\",\n    \"A silvered warrant-chain known as the Tally Loom, used to weigh cities like coins and brand them for back-tithe\",\n    \"Vast archives of toll records and census scrolls that reveal who eats, who burns, and who heals in the night\"\n  ],\n  \"beliefs_and_themes\": [\n    \"Order is the only morality; the realm’s heart must beat in time or else it fibrillates into ruin\",\n    \"Freedom is a dress rehearsal for famine; citizens prefer safety to sovereignty if the drumbeat is steady\",\n    \"Fear can be shaped into loyalty if every gesture of defiance is answered by a more elegant, more inevitable punishment\"\n  ],\n  \"moral_alignment\": \"Lawful authoritarian, convinced that compassion is a civic construct to be deployed after order, not before\",\n  \"thematic_contrast\": \"Imposing order over choice; the Steward stands as the realm’s clockwork authority against the hero’s spark of self-determined action\",\n  \"relationship_to_hero\": \"Acknowledges the hero by name only when the Chainwright (a secret guild of route-crafters) whispers that a courier has touched the Starstone at Carrowmere; thereafter he hunts not the individual but the story the figure has become\",\n  \"outer_goal\": \"Seize the Starstone Codex, map the realm to a single chart, and lock the King’s Highway into a loop that no storm, bandit, or blade can interrupt\",\n  \"inner_goal\": \"Convince himself that he rules to protect, not to control; if the Crown’s banner casts a shade, it must be one the people choose to stand under\"\n}"
    },
    {
      "type": "supporting",
      "data": "[\n  {\n    \"name\": \"Aldric Stoneleaf\",\n    \"role\": \"Mentor / Ally\",\n    \"age\": 52,\n    \"occupation\": \"Herbalist and field surgeon\",\n    \"class\": \"Free man of the village\",\n    \"appearance\": \"Lean, silver-haired, hands stained green-brown; a faded scar arcing from cheekbone to jaw\",\n    \"personality\": \"Steadfast, pragmatic, quietly patient; speaks in measured tones and keeps counsel like a locked chest\",\n    \"goal\": \"Save the people of Thornwick from a wasting sickness sweeping the lowlands\",\n    \"fear\": \"His past as a soldier will catch up and doom his reputation among the folk he now tends\",\n    \"backstory\": \"Once a man-at-arms in a lord’s retinue, Aldric left after a failed campaign that haunted him with fever and flame; since then he has stitched wounds and gathered herbs beneath the elder oak\",\n    \"skills\": [\n      \"Reading the wounds of men and beasts\",\n      \"Blend healing draughts from yarrow, sage, and honey\",\n      \"Track game by broken stems and scuffed loam\"\n    ],\n    \"signature_item\": \"A cedarwood apothecary case with copper clasps and a rabbit’s foot charm\",\n    \"relationships\": \"Protects Elfreda as a colleague and friend; skeptical of Puck’s pranks, yet grateful when they draw trouble away\",\n    \"voice\": \"Brief and precise; says 'Hush your breath' when calming a patient\",\n    \"quirk\": \"Touches the scar on his jaw when weighing a hard choice\"\n  },\n  {\n    \"name\": \"Elfreda Greenwell\",\n    \"role\": \"Love Interest / Emotional Connection (B-story)\",\n    \"age\": 29,\n    \"occupation\": \"Midwife and stitch-woman\",\n    \"class\": \"Guild-registered craftsperson\",\n    \"appearance\": \"Broad-shouldered, dark hair wound in a tight braid; warm, hazel eyes\",\n    \"personality\": \"Compassionate, principled, quietly stubborn; hears the whole village’s troubles\",\n    \"goal\": \"Deliver the safe births of spring and protect the women under her care from harm and rumor\",\n    \"fear\": \"Losing a mother or child she cannot save, and the blame that follows\",\n    \"backstory\": \"Raised by a convent’s infirmary; left rather than take vows, finding her calling in birthing-rooms and field kitchens\",\n    \"skills\": [\n      \"Calm a woman in labor with touch and story\",\n      \"Sew torn skin as neatly as any tailor\",\n      \"Read weather in clouds and the swell of rivers\"\n    ],\n    \"signature_item\": \"A salt-stained leather satchel of clean cloths and a brass bell given by her first grateful mother\",\n    \"relationships\": \"Longstanding friendship with Aldric; tolerates Puck’s antics but will box his ear if he scares a laboring mother\",\n    \"voice\": \"Low, even tones with a note of humor; calls people 'dear' and 'love' without thinking\",\n    \"quirk\": \"Keeps a sprig of rosemary behind her ear until it browns, then presses it into her ledger\"\n  },\n  {\n    \"name\": \"Puck Threadneedle\",\n    \"role\": \"Wildcard / Comic Relief\",\n    \"age\": 22,\n    \"occupation\": \"Jester, card-thrower, general meddler\",\n    \"class\": \"Traveling entertainer with a pinch of protection from the bailiff\",\n    \"appearance\": \"Goat-bearded, bright in patchwork blues and greens, always moving like a kicked pebble\",\n    \"personality\": \"Quick-witted, restless, a little cowardly yet loyal when it counts\",\n    \"goal\": \"Make the villagers laugh and win a purse worth a month’s bread without landing in the stocks\",\n    \"fear\": \"Being outed for a prank that goes too far, and the justice of a bare paddle\",\n    \"backstory\": \"Found as a babe in an overturned coop, raised by traveling folk; learned sleight-of-hand in taverns and markets\",\n    \"skills\": [\n      \"Light-fingered tricks and card flourish\",\n      \"Juggles knives until he doesn’t\",\n      \"Mimics voices for a jest or a warning\"\n    ],\n    \"signature_item\": \"Three-colored jester’s hat patched with cloth buttons and a hidden coin in each tip\",\n    \"relationships\": \"Teases Elfreda, who cuffs him; secretly respects Aldric’s steady hand; steals scraps for the stray dogs\",\n    \"voice\": \"High, prat-falling patter; ends sentences with 'or so it seems!'\",\n    \"quirk\": \"Taps his foot thrice before his next trick, as if asking luck to step in\"\n  }\n]"
    }
  ],
  "chapters": [],
  "current_step": "hero_arc",
  "current_beat_index": 0,
  "retry_count": 0,
  "errors": []
}